In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")

In [22]:
url='https://raw.githubusercontent.com/krishnaik06/model_selections/master/Purchased_Dataset.csv'
df=pd.read_csv(url)
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [4]:
df.shape

(400, 5)

In [5]:
df.size

2000

In [6]:
df.columns

Index(['User ID', 'Gender', 'Age', 'EstimatedSalary', 'Purchased'], dtype='object')

In [7]:
df.dtypes

User ID             int64
Gender             object
Age                 int64
EstimatedSalary     int64
Purchased           int64
dtype: object

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [9]:
df.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [11]:
df.isna().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

NO missing values.

In [23]:
#convert categorical column to integer using OneHotEncoding
from sklearn.preprocessing import LabelEncoder
label=LabelEncoder()
df['Gender']=label.fit_transform(df[['Gender']])
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510       1   19            19000          0
1  15810944       1   35            20000          0
2  15668575       0   26            43000          0
3  15603246       0   27            57000          0
4  15804002       1   19            76000          0

In [25]:
#create Input(X) & Output(y) features
X=df.drop(['User ID','Purchased'],axis=1)
y=df['Purchased']
print(X.head())

   Gender  Age  EstimatedSalary
0       1   19            19000
1       1   35            20000
2       0   26            43000
3       0   27            57000
4       1   19            76000

In [27]:
print(y.head())

0    0
1    0
2    0
3    0
4    0
Name: Purchased, dtype: int64

In [35]:
#split data into train test split
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(X,y,test_size=0.30,random_state=20)
print(x_train.shape[0], x_test.shape[0])

280 120

In [36]:
#apply knn classification
from sklearn.neighbors import KNeighborsClassifier
knn=KNeighborsClassifier(n_neighbors=5)
knn.fit(x_train,y_train)
y_pred=knn.predict(x_test)

#accuracy score
from sklearn.metrics import accuracy_score
y_pred=knn.predict(x_test)
print("Score", accuracy_score(y_pred,y_test)*100)

Score 78.33333333333333

##### Use cross validation select best model which giving maximum Accuracy

In [41]:
from sklearn.model_selection import cross_val_score
knn=KNeighborsClassifier(n_neighbors=5)
print("Accuracy Score", cross_val_score(knn,X,y,cv=10))
print("Average Accuracy Score", cross_val_score(knn,X,y,cv=10).mean()*100)
print("Minimum Accuracy Score", cross_val_score(knn,X,y,cv=10).min()*100)
print("Maximum Accuracy Score", cross_val_score(knn,X,y,cv=10).max()*100)

Accuracy Score [0.7   0.925 0.85  0.875 0.775 0.675 0.75  0.8   0.725 0.775]
Average Accuracy Score 78.49999999999999
Minimum Accuracy Score 67.5
Maximum Accuracy Score 92.5